      ******************************************************************
      *
      * Hello World Program in COBOL
      * ============================
      *
      *
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. helloworld.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.                         
                         
                          
       PROCEDURE DIVISION.

           DISPLAY "Hello, World!".    
           GOBACK.
      ******************************************************************
